paperclip/app/controllers/gallery_controller.rb

SELECT "images".* FROM "images" GROUP BY project
---
  def index
    @projects = Image.group("project")

SELECT "images".* FROM "images" WHERE ("images"."project" = 'IGN Prime')
SELECT "images".* FROM "images" GROUP BY project
---
  def build_index
    @projects = Image.where(:project => params[:projectname])
    @projects = @projects.group("build")

SELECT "images".* FROM "images" WHERE ("images"."project" = 'IGN Prime') GROUP BY page ORDER BY images.id DESC LIMIT 1
SELECT "images".* FROM "images" WHERE ("images"."project" = 'IGN Prime') AND ("images"."build" = '1') AND ("images"."id" >= 0) GROUP BY browser ORDER BY images.id ASC LIMIT 1000
SELECT "images".* FROM "images" WHERE ("images"."project" = 'IGN Prime') AND ("images"."build" = '1') AND ("images"."browser" = 'ie7') AND ("images"."id" >= 0) GROUP BY page ORDER BY images.id ASC LIMIT 1000
---
  def view
    @project = Image.where(:project => params[:projectname])
    @pages = Image.where(:project => params[:projectname], :build => params[:build_num])

    @project_name = params[:projectname]

    @ie7 =       @pages.where(:browser => "ie7")