paperclip/app/controllers/images_controller.rb

SELECT "images".* FROM "images" WHERE ("images"."id" = 3) LIMIT 1
---
  def show
    @image = Image.find(params[:id])

INSERT INTO "images" ("browser", "build", "created_at", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "page", "project", "updated_at") VALUES ('firefox', '1', '2011-04-08 01:11:33.881104', 'image/png', 'homepage1.png', 145674, '2011-04-08 01:11:33.849904', 'homepage', 'IGN Prime', '2011-04-08 01:11:33.881104')
---
  def create
    @image = Image.new(params[:image])

    respond_to do |format|
      if @image.save

SELECT "images".* FROM "images" WHERE ("images"."id" = 2) LIMIT 1
DELETE FROM "images" WHERE ("images"."id" = 2)
---
  def destroy
    @image = Image.find(params[:id])
    @image.destroy